# Descriptive Analysis
Importing Libraries

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv (r'E:\MCA\ML\ML Assignment\Emp.csv')

In [3]:
df

        Name  Salary Country  Unnamed: 3
0        Dan   40000     USA         NaN
1  Elizabeth   32000  Brazil         NaN
2        Jon   45000   Italy         NaN
3      Maria   54000     USA         NaN
4       Mark   72000     USA         NaN
5       Bill   62000  Brazil         NaN
6       Jess   92000   Italy         NaN
7      Julia   55000     USA         NaN
8       Jeff   35000   Italy         NaN
9        Ben   48000  Brazil         NaN

In [4]:
df.head()

        Name  Salary Country  Unnamed: 3
0        Dan   40000     USA         NaN
1  Elizabeth   32000  Brazil         NaN
2        Jon   45000   Italy         NaN
3      Maria   54000     USA         NaN
4       Mark   72000     USA         NaN

In [5]:
df.tail()

    Name  Salary Country  Unnamed: 3
5   Bill   62000  Brazil         NaN
6   Jess   92000   Italy         NaN
7  Julia   55000     USA         NaN
8   Jeff   35000   Italy         NaN
9    Ben   48000  Brazil         NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        10 non-null     object
 1   Salary      10 non-null     int64
 2   Country     10 non-null     object
 3   Unnamed: 3  0 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 304.0+ bytes

In [7]:
df.describe()

             Salary  Unnamed: 3
count     10.000000         0.0
mean   53500.000000         NaN
std    18222.391598         NaN
min    32000.000000         NaN
25%    41250.000000         NaN
50%    51000.000000         NaN
75%    60250.000000         NaN
max    92000.000000         NaN

In [8]:
mean1 = df['Salary'].mean()

In [9]:
mean1

53500.0

In [10]:
sum1 = df['Salary'].sum()

In [11]:
sum1

535000

In [12]:
max1 = df['Salary'].max()

In [13]:
max1

92000

In [14]:
min1 = df['Salary'].min()

In [15]:
min1

32000

In [16]:
count1 = df['Salary'].count()

In [17]:
count1

10

In [18]:
median1 = df['Salary'].median()

In [19]:
median1

51000.0

In [20]:
std1 = df['Salary'].std()

In [21]:
std1

18222.391598128816

In [22]:
var1 = df['Salary'].var()

In [23]:
var1

332055555.5555556

In [24]:
#group by

In [25]:
groupby_sum1 = df.groupby(['Country']).sum()

In [26]:
groupby_sum1

         Salary  Unnamed: 3
Country
Brazil   142000         0.0
Italy    172000         0.0
USA      221000         0.0

In [27]:
groupby_count1 = df.groupby(['Country']).count()

In [28]:
groupby_count1

         Name  Salary  Unnamed: 3
Country
Brazil      3       3           0
Italy       3       3           0
USA         4       4           0

In [29]:
print ('Mean salary: ' + str(mean1))
print ('Sum of salaries: ' + str(sum1))
print ('Max salary: ' + str(max1))
print ('Min salary: ' + str(min1))
print ('Count of salaries: ' + str(count1))
print ('Median salary: ' + str(median1))
print ('Std of salaries: ' + str(std1))
print ('Var of salaries: ' + str(var1))

Mean salary: 53500.0
Sum of salaries: 535000
Max salary: 92000
Min salary: 32000
Count of salaries: 10
Median salary: 51000.0
Std of salaries: 18222.391598128816
Var of salaries: 332055555.5555556

In [30]:
print ('Sum of values, grouped by the Country: ' + str(groupby_sum1))
print ('Count of values, grouped by the Country: ' + str(groupby_count1))

Sum of values, grouped by the Country:          Salary  Unnamed: 3
Country
Brazil   142000         0.0
Italy    172000         0.0
USA      221000         0.0
Count of values, grouped by the Country:          Name  Salary  Unnamed: 3
Country
Brazil      3       3           0
Italy       3       3           0
USA         4       4           0